Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.OverrideResult(System.Int32)
Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value.
Remarks:
The range of valid result values depends on the type of dialog as follows:
DialogBox: Any non-zero value will cause a dialog to be dismissed.
MessageBox: Standard Message Box IDs, such as IDOK and IDCANCEL, are accepted.
For all possible IDs, refer to the Windows API documentation.
The ID used must be relevant to the buttons in a message box.
TaskDialog: Standard Message Box IDs and Revit Custom IDs are accepted,
depending on the buttons used in a dialog. Standard buttons, such as OK
and Cancel, have standard IDs described in Windows API documentation.
Buttons with custom text have custom IDs with incremental values
starting at 1001 for the left-most or top-most button in a task dialog.
resultCode:
The result code you wish the Revit dialog to return.
Returns:
True if the result code was accepted.
Since:
2010

Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.DialogId
A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
Remarks:
The contents of this entry vary depending on the type of dialog which is shown:
DialogBox: A unique string ID that can be used to identify those whihch dialog has been invoked.TaskDialog: The customed string if TaskDialog.Id is set, empty string for default TaskDialog.Show().  For Revit-created dialog boxes, this
should always have an assigned value.Standard Message Boxes: this will be an empty string.
Since:
2017

Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.Result
Since:
2010

Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs
The base class for the event arguments used by the DialogBoxShowing event.
Remarks:
The actual type of the event arguments will be different depending upon the type of dialog shown.
When the application receives this object, a dialog is to be displayed in Revit that
requires user interaction. The OverrideResult function can be used to cause the dialog
to be dismissed and return a desired result code.
Since:
2010